NordicSemiconductor/nrfx/mdk/nrf54h20_engb_radiocore_peripherals.h
/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 3

#define VPR_INIT_PC_RESET_VALUE 0x00000000           /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR_VPR_START_RESET_VALUE 0                  /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR_RAM_BASE_ADDR 0x23040000                 /*!< (unspecified)                                                        */
#define VPR_RAM_SZ 15                                /*!< (unspecified)                                                        */
#define VPR_RETAINED 1                               /*!< (unspecified)                                                        */
#define VPR_VPRSAVEDCTX 0                            /*!< (unspecified)                                                        */
#define VPR_VPRSAVEADDR 0x00000000                   /*!< (unspecified)                                                        */
#define VPR_VPRREMAPADDRVTOB 0x00000000              /*!< (unspecified)                                                        */
#define VPR_VEVIF_NTASKS_MIN 0                       /*!< VEVIF tasks: 0..15                                                   */
#define VPR_VEVIF_NTASKS_MAX 15                      /*!< VEVIF tasks: 0..15                                                   */
#define VPR_VEVIF_NTASKS_SIZE 16                     /*!< VEVIF tasks: 0..15                                                   */
#define VPR_VEVIF_TASKS_MASK 0x0000FF00              /*!< Mask of supported VEVIF tasks: 0x0000FF00                            */
#define VPR_VEVIF_NDPPI_MIN 8                        /*!< VEVIF DPPI channels: 8..10                                           */
#define VPR_VEVIF_NDPPI_MAX 10                       /*!< VEVIF DPPI channels: 8..10                                           */
#define VPR_VEVIF_NDPPI_SIZE 11                      /*!< VEVIF DPPI channels: 8..10                                           */
#define VPR_VEVIF_NEVENTS_MIN 12                     /*!< VEVIF events: 12..15                                                 */
#define VPR_VEVIF_NEVENTS_MAX 15                     /*!< VEVIF events: 12..15                                                 */
#define VPR_VEVIF_NEVENTS_SIZE 16                    /*!< VEVIF events: 12..15                                                 */
#define VPR_DEBUGGER_OFFSET 1024                     /*!< Debugger interface register offset: 0x53034400                       */

#define VPR121_INIT_PC_RESET_VALUE 0x00000000        /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR121_VPR_START_RESET_VALUE 0               /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR121_RAM_BASE_ADDR 0x2F890000              /*!< (unspecified)                                                        */
#define VPR121_RAM_SZ 15                             /*!< (unspecified)                                                        */
#define VPR121_VPRSAVEDCTX_REGNAME NRF_MEMCONF120->POWER[0].RET /*!< (unspecified)                                             */
#define VPR121_VPRSAVEDCTX_REGBIT 23                 /*!< (unspecified)                                                        */
#define VPR121_RETAINED 0                            /*!< (unspecified)                                                        */
#define VPR121_VPRSAVEDCTX 1                         /*!< (unspecified)                                                        */
#define VPR121_VPRSAVEADDR 0x2F800000                /*!< (unspecified)                                                        */
#define VPR121_VPRREMAPADDRVTOB 0x00000000           /*!< (unspecified)                                                        */
#define VPR121_VEVIF_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..31                                                   */
#define VPR121_VEVIF_NTASKS_MAX 31                   /*!< VEVIF tasks: 0..31                                                   */
#define VPR121_VEVIF_NTASKS_SIZE 32                  /*!< VEVIF tasks: 0..31                                                   */
#define VPR121_VEVIF_TASKS_MASK 0xFFFF0000           /*!< Mask of supported VEVIF tasks: 0xFFFF0000                            */
#define VPR121_VEVIF_NDPPI_MIN 24                    /*!< VEVIF DPPI channels: 24..27                                          */
#define VPR121_VEVIF_NDPPI_MAX 27                    /*!< VEVIF DPPI channels: 24..27                                          */
#define VPR121_VEVIF_NDPPI_SIZE 28                   /*!< VEVIF DPPI channels: 24..27                                          */
#define VPR121_VEVIF_NEVENTS_MIN 28                  /*!< VEVIF events: 28..31                                                 */
#define VPR121_VEVIF_NEVENTS_MAX 31                  /*!< VEVIF events: 28..31                                                 */
#define VPR121_VEVIF_NEVENTS_SIZE 32                 /*!< VEVIF events: 28..31                                                 */
#define VPR121_DEBUGGER_OFFSET 1024                  /*!< Debugger interface register offset: 0x5F8D4400                       */

#define VPR130_INIT_PC_RESET_VALUE 0x00000000        /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR130_VPR_START_RESET_VALUE 0               /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR130_RAM_BASE_ADDR 0x2FC00000              /*!< (unspecified)                                                        */
#define VPR130_RAM_SZ 15                             /*!< (unspecified)                                                        */
#define VPR130_VPRSAVEDCTX_REGNAME NRF_MEMCONF130->POWER[0].RET /*!< (unspecified)                                             */
#define VPR130_VPRSAVEDCTX_REGBIT 5                  /*!< (unspecified)                                                        */
#define VPR130_RETAINED 1                            /*!< (unspecified)                                                        */
#define VPR130_VPRSAVEDCTX 1                         /*!< (unspecified)                                                        */
#define VPR130_VPRSAVEADDR 0x2F800000                /*!< (unspecified)                                                        */
#define VPR130_VPRREMAPADDRVTOB 0x00000000           /*!< (unspecified)                                                        */
#define VPR130_VEVIF_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..15                                                   */
#define VPR130_VEVIF_NTASKS_MAX 15                   /*!< VEVIF tasks: 0..15                                                   */
#define VPR130_VEVIF_NTASKS_SIZE 16                  /*!< VEVIF tasks: 0..15                                                   */
#define VPR130_VEVIF_TASKS_MASK 0x0000FFF0           /*!< Mask of supported VEVIF tasks: 0x0000FFF0                            */
#define VPR130_VEVIF_NDPPI_MIN 8                     /*!< VEVIF DPPI channels: 8..11                                           */
#define VPR130_VEVIF_NDPPI_MAX 11                    /*!< VEVIF DPPI channels: 8..11                                           */
#define VPR130_VEVIF_NDPPI_SIZE 12                   /*!< VEVIF DPPI channels: 8..11                                           */
#define VPR130_VEVIF_NEVENTS_MIN 12                  /*!< VEVIF events: 12..15                                                 */
#define VPR130_VEVIF_NEVENTS_MAX 15                  /*!< VEVIF events: 12..15                                                 */
#define VPR130_VEVIF_NEVENTS_SIZE 16                 /*!< VEVIF events: 12..15                                                 */
#define VPR130_DEBUGGER_OFFSET 1024                  /*!< Debugger interface register offset: 0x5F908400                       */

/*Accelerated Address Resolver*/
#define AAR_PRESENT 1
#define AAR_COUNT 2

#define AAR030_DMAERROR 1                            /*!< (unspecified)                                                        */
#define AAR030_ERRORSTATUS 0                         /*!< (unspecified)                                                        */
#define AAR030_ERROREVENT 0                          /*!< (unspecified)                                                        */

#define AAR031_DMAERROR 1                            /*!< (unspecified)                                                        */
#define AAR031_ERRORSTATUS 0                         /*!< (unspecified)                                                        */
#define AAR031_ERROREVENT 0                          /*!< (unspecified)                                                        */

/*AES CCM Mode Encryption*/
#define CCM_PRESENT 1
#define CCM_COUNT 2

#define CCM030_AMOUNTREG 0                           /*!< (unspecified)                                                        */
#define CCM030_ONTHEFLYDECRYPTION 0                  /*!< (unspecified)                                                        */
#define CCM030_DMAERROR 1                            /*!< (unspecified)                                                        */

#define CCM031_AMOUNTREG 0                           /*!< (unspecified)                                                        */
#define CCM031_ONTHEFLYDECRYPTION 0                  /*!< (unspecified)                                                        */
#define CCM031_DMAERROR 1                            /*!< (unspecified)                                                        */

/*AES ECB Mode Encryption*/
#define ECB_PRESENT 1
#define ECB_COUNT 2

#define ECB030_AMOUNTREG 0                           /*!< (unspecified)                                                        */
#define ECB030_DMAERROR 1                            /*!< (unspecified)                                                        */
#define ECB030_ERRORSTATUS 0                         /*!< (unspecified)                                                        */

#define ECB031_AMOUNTREG 0                           /*!< (unspecified)                                                        */
#define ECB031_DMAERROR 1                            /*!< (unspecified)                                                        */
#define ECB031_ERRORSTATUS 0                         /*!< (unspecified)                                                        */

/*IPCT APB registers*/
#define IPCT_PRESENT 1
#define IPCT_COUNT 3

